In [1]:
import numpy as np
import pandas as pd
 
from pandas import Series,DataFrame

In [3]:
ser1 = Series([0,1,2],index=['A','B','C'])

ser1

A    0
B    1
C    2
dtype: int64

In [4]:
ser2 = Series([3,4,5,6],index=['A','B','C','D'])

ser2

A    3
B    4
C    5
D    6
dtype: int64

In [5]:
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [7]:
# It does not add a value and a Null value. Outputs 'Null'.
# Note that the NaN values are added in automatically.

In [9]:
# Now let's try it with DataFrames.
dframe1 = DataFrame(np.arange(4).reshape((2,2)),
                   columns=list('AB'),
                   index=['NYC','LA'])

dframe1

     A  B
NYC  0  1
LA   2  3

In [14]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)),
                    columns=list('ADC'),
                    index=['NYC','LA','SF'])

dframe2

     A  D  C
NYC  0  1  2
LA   3  4  5
SF   6  7  8

In [15]:
dframe1 + dframe2

       A   B   C   D
LA   5.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [19]:
# What if we want to replace the NaN values
# Use .add()

dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA   5.0  3.0  5.0  4.0
NYC  0.0  1.0  2.0  1.0
SF   6.0  NaN  8.0  7.0

In [22]:
# Now we can see that the values are filled, however there was no SF,B value so that is still NaN

# This is a powerful tool when you want to add differently-sized dataframes.

In [30]:
dframe2

     A  D  C
NYC  0  1  2
LA   3  4  5
SF   6  7  8

In [31]:
#Lets learn about operations betwen a Series and a DataFrame

In [32]:
# Create a Series from DataFrame's 0 row
ser3 = dframe2.iloc[0]

ser3

A    0
D    1
C    2
Name: NYC, dtype: int64

In [33]:
dframe2 - ser3

     A  D  C
NYC  0  0  0
LA   3  3  3
SF   6  6  6